# A Dynamic Context-aware Aggregation Strategy (DCAS) for Small Object Detection, GPL-3.0 license
# YOLOv8+DCAS object detection model with P2-P4 outputs.

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n+DCAS.yaml' will call yolov8+DCAS.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n+DCAS
  s: [0.33, 0.50, 1024]  # YOLOv8s+DCAS
  m: [0.67, 0.75, 768]   # YOLOv8m+DCAS
  l: [1.00, 1.00, 512]   # YOLOv8l+DCAS
  x: [1.00, 1.25, 512]   # YOLOv8x+DCAS

# YOLOv8+DCAS backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, DSPPF, [512]]  # 7

# YOLOv8+DCAS head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [ 4, 1, Conv, [256, 3, 2]]  # 9
  - [[-1, 6, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [ 2, 1, Conv, [128, 3, 2]]  # 13
  - [[-1, 4, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [ 0, 1, Conv, [64, 3, 2]]  # 17
  - [[-1, 2, 16], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]  # 19 (P2/4-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 22 (P3/8-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]  # 25 (P4/16-large)

  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P2, P3, P4)
